<a href="https://colab.research.google.com/github/sureshmecad/Samrat-Ashok-Technology-Internship/blob/main/Day53_Replace_empty_values_with_mean_median_mode_CSEPathshala.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Replace Empty Values**

- Another way of dealing with empty cells is to insert a new value instead.

- This way we do not have to delete entire rows just because of some empty cells.

- The **fillna()** method allows us to replace empty cells with a value.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Replace null values with the "Goud"

df = pd.DataFrame({'First Name': ["Nirmal", "Priyanka", "Resham", "Jalj", "Pinky", "Result"],
                   'Last Name': ['Gaud', 'Gaud', 'Gaud', np.nan, np.nan, np.nan],
                   'School Name': [201, 202, 203, 204, 205, np.nan]})

df
df1 = df.copy()

In [3]:
df.fillna('Gaud', inplace=True)
df

  First Name Last Name School Name
0     Nirmal      Gaud         201
1   Priyanka      Gaud         202
2     Resham      Gaud         203
3       Jalj      Gaud         204
4      Pinky      Gaud         205
5     Result      Gaud        Gaud

**Replace only for a Specified Columns**

- The example above replaces all empty cells in the whole DataFrame.

- To only replace empty values for one column, specify the column name for the dataframe.

**Replace NULL values in the "Last Name" column with the number 130**

In [4]:
df['Last Name'].fillna('Gaud', inplace=True)
df

  First Name Last Name School Name
0     Nirmal      Gaud         201
1   Priyanka      Gaud         202
2     Resham      Gaud         203
3       Jalj      Gaud         204
4      Pinky      Gaud         205
5     Result      Gaud        Gaud

**Replace using Mean, Median, Mode**

- A common way to **replace empty cells**, is to calculate the **mean, median or mode** value for the column.

- Pandas uses the **mean() median() and mode()** methods to calculate respective values for a specified column.

**Mean: The average value (the sum of all values divided by number values**

In [8]:
# calculate the MEAN, and replace any empty values with it
x = df1['School Name'].mean()
df1['School Name'].fillna(x, inplace=True)
df1

  First Name Last Name  School Name
0     Nirmal      Gaud        201.0
1   Priyanka      Gaud        202.0
2     Resham      Gaud        203.0
3       Jalj       NaN        204.0
4      Pinky       NaN        205.0
5     Result       NaN        203.0

**Median: the value in the middle, after you have sorted all values ascending**

In [9]:
# calculate the MEDIAN, and replace any empty values with it
x = df1['School Name'].median()
df1['School Name'].fillna(x, inplace=True)
df1

  First Name Last Name  School Name
0     Nirmal      Gaud        201.0
1   Priyanka      Gaud        202.0
2     Resham      Gaud        203.0
3       Jalj       NaN        204.0
4      Pinky       NaN        205.0
5     Result       NaN        203.0

**Mode: the value that appears most frequently**

In [10]:
# calculate the MODE, and replace any empty values with it
x = df1['School Name'].mode()
df1['School Name'].fillna(x, inplace=True)
df1

  First Name Last Name  School Name
0     Nirmal      Gaud        201.0
1   Priyanka      Gaud        202.0
2     Resham      Gaud        203.0
3       Jalj       NaN        204.0
4      Pinky       NaN        205.0
5     Result       NaN        203.0

#### **Reference**

- https://www.youtube.com/watch?v=dQJBhAuMu3g&list=PLzx-_kRo3HZtP3tWaieUPwAh9K4I00_6p&index=42